AndEmi81/indesit_inertia_rx210/HAL/FS_MC9S08_GT60/FS_MC9S08_GT60_reg.h
#define ATD1C_PRS0_MASK                 1
#define ATD1C_PRS1_MASK                 2
#define ATD1C_PRS2_MASK                 4
#define ATD1C_PRS3_MASK                 8
#define ATD1C_SGN_MASK                  16
#define ATD1C_RES8_MASK                 32
#define ATD1C_DJM_MASK                  64
#define ATD1C_ATDPU_MASK                128
#define ATD1C_PRS_MASK                  15
#define ATD1C_PRS_BITNUM                0


/*** ATD1SC - ATD1 Status and Control Register; 0x00000051 ***/
typedef union {
  byte Byte;
  struct {
    byte ATDCH0      :1;                                       /* Analog Input Channel Select Bit 0 */
    byte ATDCH1      :1;                                       /* Analog Input Channel Select Bit 1 */
    byte ATDCH2      :1;                                       /* Analog Input Channel Select Bit 2 */
    byte ATDCH3      :1;                                       /* Analog Input Channel Select Bit 3 */
    byte ATDCH4      :1;                                       /* Analog Input Channel Select Bit 4 */
    byte ATDCO       :1;                                       /* ATD Continuous Conversion */
    byte ATDIE       :1;                                       /* ATD Interrupt Enabled */
    byte CCF         :1;                                       /* Conversion Complete Flag */
  } Bits;
  struct {
    byte grpATDCH :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ATD1SCSTR;
extern volatile ATD1SCSTR _ATD1SC @0x00000051;
#define ATD1SC                          _ATD1SC.Byte
#define ATD1SC_ATDCH0                   _ATD1SC.Bits.ATDCH0
#define ATD1SC_ATDCH1                   _ATD1SC.Bits.ATDCH1
#define ATD1SC_ATDCH2                   _ATD1SC.Bits.ATDCH2
#define ATD1SC_ATDCH3                   _ATD1SC.Bits.ATDCH3
#define ATD1SC_ATDCH4                   _ATD1SC.Bits.ATDCH4
#define ATD1SC_ATDCO                    _ATD1SC.Bits.ATDCO
#define ATD1SC_ATDIE                    _ATD1SC.Bits.ATDIE
#define ATD1SC_CCF                      _ATD1SC.Bits.CCF
#define ATD1SC_ATDCH                    _ATD1SC.MergedBits.grpATDCH

#define ATD1SC_ATDCH0_MASK              1
#define ATD1SC_ATDCH1_MASK              2
#define ATD1SC_ATDCH2_MASK              4
#define ATD1SC_ATDCH3_MASK              8
#define ATD1SC_ATDCH4_MASK              16
#define ATD1SC_ATDCO_MASK               32
#define ATD1SC_ATDIE_MASK               64
#define ATD1SC_CCF_MASK                 128
#define ATD1SC_ATDCH_MASK               31
#define ATD1SC_ATDCH_BITNUM             0


/*** ATD1R - ATD1 Result Data; 0x00000052 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1RH - ATD1 Result Data High Right Justified; 0x00000052 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* ATD Result Data Bit 8 */
        byte BIT9        :1;                                       /* ATD Result Data Bit 9 */
        byte BIT10       :1;                                       /* ATD Result Data Bit 10 */
        byte BIT11       :1;                                       /* ATD Result Data Bit 11 */
        byte BIT12       :1;                                       /* ATD Result Data Bit 12 */
        byte BIT13       :1;                                       /* ATD Result Data Bit 13 */
        byte BIT14       :1;                                       /* ATD Result Data Bit 14 */
        byte BIT15       :1;                                       /* ATD Result Data Bit 15 */
      } Bits;
    } ATD1RHSTR;
    #define ATD1RH                      _ATD1R.Overlap_STR.ATD1RHSTR.Byte
    #define ATD1RH_BIT8                 _ATD1R.Overlap_STR.ATD1RHSTR.Bits.BIT8
    #define ATD1RH_BIT9                 _ATD1R.Overlap_STR.ATD1RHSTR.Bits.BIT9
    #define ATD1RH_BIT10                _ATD1R.Overlap_STR.ATD1RHSTR.Bits.BIT10
    #define ATD1RH_BIT11                _ATD1R.Overlap_STR.ATD1RHSTR.Bits.BIT11
    #define ATD1RH_BIT12                _ATD1R.Overlap_STR.ATD1RHSTR.Bits.BIT12
    #define ATD1RH_BIT13                _ATD1R.Overlap_STR.ATD1RHSTR.Bits.BIT13
    #define ATD1RH_BIT14                _ATD1R.Overlap_STR.ATD1RHSTR.Bits.BIT14
    #define ATD1RH_BIT15                _ATD1R.Overlap_STR.ATD1RHSTR.Bits.BIT15
    
    #define ATD1RH_BIT8_MASK            1
    #define ATD1RH_BIT9_MASK            2
    #define ATD1RH_BIT10_MASK           4
    #define ATD1RH_BIT11_MASK           8
    #define ATD1RH_BIT12_MASK           16
    #define ATD1RH_BIT13_MASK           32
    #define ATD1RH_BIT14_MASK           64
    #define ATD1RH_BIT15_MASK           128
    

    /*** ATD1RL - ATD1 Result Data Low Right Justified; 0x00000053 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* ATD Result Data Bit 0 */
        byte BIT1        :1;                                       /* ATD Result Data Bit 1 */
        byte BIT2        :1;                                       /* ATD Result Data Bit 2 */
        byte BIT3        :1;                                       /* ATD Result Data Bit 3 */
        byte BIT4        :1;                                       /* ATD Result Data Bit 4 */
        byte BIT5        :1;                                       /* ATD Result Data Bit 5 */
        byte BIT6        :1;                                       /* ATD Result Data Bit 6 */
        byte BIT7        :1;                                       /* ATD Result Data Bit 7 */
      } Bits;
    } ATD1RLSTR;
    #define ATD1RL                      _ATD1R.Overlap_STR.ATD1RLSTR.Byte
    #define ATD1RL_BIT0                 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT0
    #define ATD1RL_BIT1                 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT1
    #define ATD1RL_BIT2                 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT2
    #define ATD1RL_BIT3                 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT3
    #define ATD1RL_BIT4                 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT4
    #define ATD1RL_BIT5                 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT5
    #define ATD1RL_BIT6                 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT6
    #define ATD1RL_BIT7                 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT7
    
    #define ATD1RL_BIT0_MASK            1
    #define ATD1RL_BIT1_MASK            2
    #define ATD1RL_BIT2_MASK            4
    #define ATD1RL_BIT3_MASK            8
    #define ATD1RL_BIT4_MASK            16
    #define ATD1RL_BIT5_MASK            32
    #define ATD1RL_BIT6_MASK            64
    #define ATD1RL_BIT7_MASK            128
    
  } Overlap_STR;

} ATD1RSTR;
extern volatile ATD1RSTR _ATD1R @0x00000052;
#define ATD1R                           _ATD1R.Word


